0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    airfoilDown
    {
	    type        	angularOscillatingDisplacement;
		value			uniform (0 0 0);
		axis			(0 0 1);
		origin			(0.5 0 0);
		angle0			0;
		amplitude		10;
		omega			1;
    }
    airfoilUp
    {
	    type        	angularOscillatingDisplacement;
		value			uniform (0 0 0);
		axis			(0 0 1);
		origin			(0.5 0 0);
		angle0			0;
		amplitude		10;
		omega			1;
    }
    farfield
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
